In [224]:
import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

In [225]:
melb_data = pd.read_csv('data/melb_data_ps.csv',sep=',')
melb_df = melb_data.copy()

melb_df.head()

   index      Suburb           Address  Rooms Type      Price Method SellerG       Date  Distance  Postcode  Bedroom  Bathroom  Car  Landsize  BuildingArea  YearBuilt CouncilArea  Lattitude  Longtitude             Regionname  Propertycount         Coordinates
0      0  Abbotsford      85 Turner St      2    h  1480000.0      S  Biggin  3/12/2016       2.5      3067        2         1    1     202.0         126.0       1970       Yarra   -37.7996    144.9984  Northern Metropolitan           4019  -37.7996, 144.9984
1      1  Abbotsford   25 Bloomburg St      2    h  1035000.0      S  Biggin  4/02/2016       2.5      3067        2         1    0     156.0          79.0       1900       Yarra   -37.8079    144.9934  Northern Metropolitan           4019  -37.8079, 144.9934
2      2  Abbotsford      5 Charles St      3    h  1465000.0     SP  Biggin  4/03/2017       2.5      3067        3         2    0     134.0         150.0       1900       Yarra   -37.8093    144.9944  Northern Metropolitan           4019  -37.8093, 144.9944
3      3  Abbotsford  40 Federation La      3    h   850000.0     PI  Biggin  4/03/2017       2.5      3067        3         2    1      94.0         126.0       1970       Yarra   -37.7969    144.9969  Northern Metropolitan           4019  -37.7969, 144.9969
4      4  Abbotsford       55a Park St      4    h  1600000.0     VB  Nelson  4/06/2016       2.5      3067        3         1    2     120.0         142.0       2014       Yarra   -37.8072    144.9941  Northern Metropolitan           4019  -37.8072, 144.9941

In [226]:
price_square = melb_df['Price']**2

price_square

0        2.190400e+12
1        1.071225e+12
2        2.146225e+12
3        7.225000e+11
4        2.560000e+12
             ...
13575    1.550025e+12
13576    1.062961e+12
13577    1.368900e+12
13578    6.250000e+12
13579    1.651225e+12
Name: Price, Length: 13580, dtype: float64

In [227]:
price_square = []
for price in melb_df['Price']:
    price_square.append(price**2)
price_square = pd.Series(price_square)

price_square

0        2.190400e+12
1        1.071225e+12
2        2.146225e+12
3        7.225000e+11
4        2.560000e+12
             ...
13575    1.550025e+12
13576    1.062961e+12
13577    1.368900e+12
13578    6.250000e+12
13579    1.651225e+12
Length: 13580, dtype: float64

In [228]:
customer_df = pd.DataFrame({
        'number': [0, 1, 2, 3, 4],
        'cust_id': [128, 1201, 9832, 4392, 7472],
        'cust_age': [13, 21, 19, 21, 60],
        'cust_sale': [0, 0, 0.2, 0.15, 0.3],
        'cust_year_birth': [2008, 2000, 2002, 2000, 1961],
        'cust_order': [1400, 14142, 900, 1240, 8430]
    })


customer_df

   number  cust_id  cust_age  cust_sale  cust_year_birth  cust_order
0       0      128        13       0.00             2008        1400
1       1     1201        21       0.00             2000       14142
2       2     9832        19       0.20             2002         900
3       3     4392        21       0.15             2000        1240
4       4     7472        60       0.30             1961        8430

In [229]:
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})

countries_df

     country  population    square
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [230]:
density = (countries_df['population']*1000000)/countries_df['square']

round(density.mean(),2)

84.93

### Task 3.3

In [231]:
melb_df['Date'] = pd.to_datetime(melb_df['Date'], dayfirst=True)

In [232]:
melb_df['WeekdaySale'] = melb_df['Date'].dt.dayofweek

melb_df[(melb_df['WeekdaySale']==5) | (melb_df['WeekdaySale']==6)].shape[0]

12822

In [233]:
melb_df.head(3)

   index      Suburb          Address  Rooms Type      Price Method SellerG       Date  Distance  Postcode  Bedroom  Bathroom  Car  Landsize  BuildingArea  YearBuilt CouncilArea  Lattitude  Longtitude             Regionname  Propertycount         Coordinates  WeekdaySale
0      0  Abbotsford     85 Turner St      2    h  1480000.0      S  Biggin 2016-12-03       2.5      3067        2         1    1     202.0         126.0       1970       Yarra   -37.7996    144.9984  Northern Metropolitan           4019  -37.7996, 144.9984            5
1      1  Abbotsford  25 Bloomburg St      2    h  1035000.0      S  Biggin 2016-02-04       2.5      3067        2         1    0     156.0          79.0       1900       Yarra   -37.8079    144.9934  Northern Metropolitan           4019  -37.8079, 144.9934            3
2      2  Abbotsford     5 Charles St      3    h  1465000.0     SP  Biggin 2017-03-04       2.5      3067        3         2    0     134.0         150.0       1900       Yarra   -37.8093    144.9944  Northern Metropolitan           4019  -37.8093, 144.9944            5

### Task 3.4 - 3.5

In [234]:
import pandas as pd

ufo_data = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv',sep=',')

ufo_data.head(10)

                   City Colors Reported Shape Reported State              Time
0                Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3               Abilene             NaN           DISK    KS    6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00
5           Valley City             NaN           DISK    ND   9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA    6/15/1935 0:00
7                  Alma             NaN           DISK    MI    7/15/1936 0:00
8               Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
9               Hubbard             NaN       CYLINDER    OR    6/15/1937 0:00

In [235]:
ufo_data.describe()

           City Colors Reported Shape Reported  State              Time
count     18216            2882          15597  18241             18241
unique     6476              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [236]:
ufo_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

In [237]:
ufo_data['Time'] = pd.to_datetime(ufo_data['Time'],dayfirst=True)
ufo_data['Time'].mode()

0   1999-11-16 19:00:00
Name: Time, dtype: datetime64[ns]

In [238]:
ufo_data.describe().loc[:,['Time']]

C:\Users\Alex\AppData\Local\Temp\ipykernel_8340\840556326.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  ufo_data.describe().loc[:,['Time']]

                       Time
count                 18241
unique                16145
top     1999-11-16 19:00:00
freq                     27
first   1930-01-06 22:00:00
last    2000-12-31 23:59:00

In [239]:
ufo_data['Date'] = ufo_data['Time'].dt.date
 
round(ufo_data[ufo_data['State']=='NV']['Date'].diff().dt.days.mean())

69

### Task 4.2

In [240]:
melb_df.head(3)

   index      Suburb          Address  Rooms Type      Price Method SellerG       Date  Distance  Postcode  Bedroom  Bathroom  Car  Landsize  BuildingArea  YearBuilt CouncilArea  Lattitude  Longtitude             Regionname  Propertycount         Coordinates  WeekdaySale
0      0  Abbotsford     85 Turner St      2    h  1480000.0      S  Biggin 2016-12-03       2.5      3067        2         1    1     202.0         126.0       1970       Yarra   -37.7996    144.9984  Northern Metropolitan           4019  -37.7996, 144.9984            5
1      1  Abbotsford  25 Bloomburg St      2    h  1035000.0      S  Biggin 2016-02-04       2.5      3067        2         1    0     156.0          79.0       1900       Yarra   -37.8079    144.9934  Northern Metropolitan           4019  -37.8079, 144.9934            3
2      2  Abbotsford     5 Charles St      3    h  1465000.0     SP  Biggin 2017-03-04       2.5      3067        3         2    0     134.0         150.0       1900       Yarra   -37.8093    144.9944  Northern Metropolitan           4019  -37.8093, 144.9944            5

In [241]:
melb_df['WeekdaySale'].value_counts()

5    11759
6     1063
0      597
1      133
3       28
Name: WeekdaySale, dtype: int64

In [242]:
def get_weekend(weekday):
  if weekday >= 5:
    return 1
  return 0  

melb_df['Weekend'] = melb_df['WeekdaySale'].apply(get_weekend)

melb_df['Weekend'].value_counts()

1    12822
0      758
Name: Weekend, dtype: int64

In [243]:
mean_price_weekend = melb_df[melb_df['Weekend']==1]['Price'].mean()
round(mean_price_weekend)

1081199

### Task 4.3

In [244]:
most_popular = melb_df['SellerG'].value_counts().nlargest(49).index

melb_df['SellerG'] = melb_df['SellerG'].apply(lambda x: x if x in most_popular else 'other') 

nelson_min_price = melb_df[melb_df['SellerG'] == 'Nelson']['Price'].min()
other_min_price = melb_df[melb_df['SellerG'] == 'other']['Price'].min()

diff = round(nelson_min_price / other_min_price, 1)

diff

1.3

In [245]:
melb_df.head(3)

   index      Suburb          Address  Rooms Type      Price Method SellerG       Date  Distance  Postcode  Bedroom  Bathroom  Car  Landsize  BuildingArea  YearBuilt CouncilArea  Lattitude  Longtitude             Regionname  Propertycount         Coordinates  WeekdaySale  Weekend
0      0  Abbotsford     85 Turner St      2    h  1480000.0      S  Biggin 2016-12-03       2.5      3067        2         1    1     202.0         126.0       1970       Yarra   -37.7996    144.9984  Northern Metropolitan           4019  -37.7996, 144.9984            5        1
1      1  Abbotsford  25 Bloomburg St      2    h  1035000.0      S  Biggin 2016-02-04       2.5      3067        2         1    0     156.0          79.0       1900       Yarra   -37.8079    144.9934  Northern Metropolitan           4019  -37.8079, 144.9934            3        0
2      2  Abbotsford     5 Charles St      3    h  1465000.0     SP  Biggin 2017-03-04       2.5      3067        3         2    0     134.0         150.0       1900       Yarra   -37.8093    144.9944  Northern Metropolitan           4019  -37.8093, 144.9944            5        1

### Task 6.1 - 6.12

In [246]:
siti_bike = pd.read_csv('data/citibike-tripdata.csv',sep=',')

siti_bike.head(2)

                  starttime                  stoptime  start station id               start station name  start station latitude  start station longitude  end station id            end station name  end station latitude  end station longitude  bikeid    usertype  birth year  gender
0  2018-09-01 00:00:05.2690  2018-09-01 00:27:20.6340             252.0     MacDougal St & Washington Sq               40.732264               -73.998522           366.0    Clinton Ave & Myrtle Ave             40.693261             -73.968896   25577  Subscriber        1980       1
1  2018-09-01 00:00:11.2810  2018-09-01 00:02:23.4810             314.0  Cadman Plaza West & Montague St               40.693830               -73.990539          3242.0  Schermerhorn St & Court St             40.691029             -73.991834   34377  Subscriber        1969       0

In [247]:
siti_bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 14 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   starttime                300000 non-null  object
 1   stoptime                 300000 non-null  object
 2   start station id         299831 non-null  float64
 3   start station name       299831 non-null  object
 4   start station latitude   300000 non-null  float64
 5   start station longitude  300000 non-null  float64
 6   end station id           299831 non-null  float64
 7   end station name         299831 non-null  object
 8   end station latitude     300000 non-null  float64
 9   end station longitude    300000 non-null  float64
 10  bikeid                   300000 non-null  int64
 11  usertype                 300000 non-null  object
 12  birth year               300000 non-null  int64
 13  gender                   300000 non-null  int64
dtypes: float64(6), int64(3), object(5)
memory usage: 32.0+ MB

In [248]:
siti_bike['start station id'].value_counts()

281.0     1928
2006.0    1909
519.0     1873
514.0     1845
426.0     1835
          ...
3432.0      15
3599.0      11
2005.0       9
3704.0       7
3583.0       6
Name: start station id, Length: 759, dtype: int64

In [249]:
siti_bike['start station id'].mode()[0]

281.0

In [250]:
siti_bike['bikeid'].mode()[0]

33887

In [251]:
most_usertype = siti_bike['usertype'].value_counts(normalize=True)[0]
round(most_usertype,2)

0.77

In [252]:
mode_usertype = siti_bike['usertype'].mode()[0]

count_mode_user = siti_bike[siti_bike['usertype'] == mode_usertype].shape[0]

round(count_mode_user/siti_bike.shape[0],2)

0.77

In [253]:
user_men = siti_bike[siti_bike['gender'] == 1].shape[0]
user_women = siti_bike[siti_bike['gender'] == 2].shape[0]

print(f'user_men: {user_men}, user_women: {user_women}')

user_men: 183582, user_women: 74506

In [254]:
siti_bike['start station id'].nunique() != siti_bike['end station id'].nunique()

True

In [255]:
siti_bike['starttime']

0         2018-09-01 00:00:05.2690
1         2018-09-01 00:00:11.2810
2         2018-09-01 00:00:20.6490
3         2018-09-01 00:00:21.7460
4         2018-09-01 00:00:27.3150
                    ...
299995    2018-09-05 19:08:27.8460
299996    2018-09-05 19:08:28.3700
299997    2018-09-05 19:08:27.5090
299998    2018-09-05 19:08:29.2300
299999    2018-09-05 19:08:29.7110
Name: starttime, Length: 300000, dtype: object

In [256]:
siti_bike['starttime'] = pd.to_datetime(siti_bike['starttime'],dayfirst=True)
siti_bike['starttime']

0        2018-09-01 00:00:05.269
1        2018-09-01 00:00:11.281
2        2018-09-01 00:00:20.649
3        2018-09-01 00:00:21.746
4        2018-09-01 00:00:27.315
                   ...
299995   2018-09-05 19:08:27.846
299996   2018-09-05 19:08:28.370
299997   2018-09-05 19:08:27.509
299998   2018-09-05 19:08:29.230
299999   2018-09-05 19:08:29.711
Name: starttime, Length: 300000, dtype: datetime64[ns]

In [257]:
(siti_bike['starttime'].dt.year - siti_bike['birth year']).min()

16

In [258]:
siti_bike['start station name'].value_counts()

Grand Army Plaza & Central Park S    1928
Central Park S & 6 Ave               1909
Pershing Square North                1873
12 Ave & W 40 St                     1845
West St & Chambers St                1835
                                     ...
NYCBS Depot - GOW                      15
Franklin Ave & Empire Blvd             11
Railroad Ave & Kay Ave                  9
47 Ave & Skillman Ave                   7
Eastern Pkwy & Washington Ave           6
Name: start station name, Length: 759, dtype: int64

In [259]:
siti_bike['start station name'].describe()

count                                299831
unique                                  759
top       Grand Army Plaza & Central Park S
freq                                   1928
Name: start station name, dtype: object

In [260]:
siti_bike['end station name'].value_counts()

West St & Chambers St          1963
12 Ave & W 40 St               1909
Pershing Square North          1850
Central Park S & 6 Ave         1828
E 17 St & Broadway             1804
                               ...
Exchange Place                    3
Union St                          1
Warren St                         1
Montrose Ave & Bushwick Ave       1
Liberty Light Rail                1
Name: end station name, Length: 765, dtype: int64

In [261]:
siti_bike = siti_bike.drop(['start station id','end station id'],axis=1)
siti_bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 12 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   starttime                300000 non-null  datetime64[ns]
 1   stoptime                 300000 non-null  object
 2   start station name       299831 non-null  object
 3   start station latitude   300000 non-null  float64
 4   start station longitude  300000 non-null  float64
 5   end station name         299831 non-null  object
 6   end station latitude     300000 non-null  float64
 7   end station longitude    300000 non-null  float64
 8   bikeid                   300000 non-null  int64
 9   usertype                 300000 non-null  object
 10  birth year               300000 non-null  int64
 11  gender                   300000 non-null  int64
dtypes: datetime64[ns](1), float64(4), int64(3), object(4)
memory usage: 27.5+ MB

In [262]:
siti_bike.head()

                starttime                  stoptime               start station name  start station latitude  start station longitude            end station name  end station latitude  end station longitude  bikeid    usertype  birth year  gender
0 2018-09-01 00:00:05.269  2018-09-01 00:27:20.6340     MacDougal St & Washington Sq               40.732264               -73.998522    Clinton Ave & Myrtle Ave             40.693261             -73.968896   25577  Subscriber        1980       1
1 2018-09-01 00:00:11.281  2018-09-01 00:02:23.4810  Cadman Plaza West & Montague St               40.693830               -73.990539  Schermerhorn St & Court St             40.691029             -73.991834   34377  Subscriber        1969       0
2 2018-09-01 00:00:20.649  2018-09-01 00:55:58.5470                  1 Ave & E 62 St               40.761227               -73.960940             Smith St & 3 St             40.678724             -73.995991   30496  Subscriber        1975       1
3 2018-09-01 00:00:21.746  2018-09-01 00:07:38.5830          St James Pl & Oliver St               40.713079               -73.998512         Park Pl & Church St             40.713342             -74.009355   28866  Subscriber        1984       2
4 2018-09-01 00:00:27.315  2018-09-01 02:21:25.3080                  W 13 St & 6 Ave               40.736494               -73.997044            W 4 St & 7 Ave S             40.734011             -74.002939   20943    Customer        1994       1

In [263]:
siti_bike['age'] = 2018 - siti_bike['birth year']

greater_60 = siti_bike[siti_bike['age'] > 60].shape[0] 

greater_60

11837

In [288]:
siti_bike['starttime'] = pd.to_datetime(siti_bike['starttime'],dayfirst=True)
siti_bike['stoptime'] = pd.to_datetime(siti_bike['stoptime'],dayfirst=True)

siti_bike['trip duration'] = siti_bike['stoptime'] - siti_bike['starttime']

siti_bike['trip duration'].mean().seconds

1126